Revit 2027 API
ParameterTypeId.ExcavationElementFamilyAndType Property
 "Element Family and Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExcavationElementFamilyAndType { get; }
Public Shared ReadOnly Property ExcavationElementFamilyAndType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExcavationElementFamilyAndType {
	ForgeTypeId^ get ();
}
static member ExcavationElementFamilyAndType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace